apiproxy/policies/findEBooks-build-soap.xml

<?xml version="1.0" encoding="UTF-8" standalone="yes"?>
<AssignMessage async="false" continueOnError="true" enabled="true" name="findEBooks-build-soap">
    <DisplayName>findEBooks Build SOAP</DisplayName>
    <Add>
        <Headers>
            <Header name="SOAPAction"/>
        </Headers>
    </Add>
    <Set>
        <Headers>
            <Header name="Content-Type">text/xml; charset=utf-8</Header>
        </Headers>
        <Payload contentType="text/xml">
            <s11:Envelope xmlns:s11="http://schemas.xmlsoap.org/soap/envelope/">
                <s11:Body>
                    <ns1:findEBooks xmlns:ns1="http://endpoint.jaxws.javaee7.org/">
                        <!-- optional -->
                        <arg0>{arg0}</arg0>
                    </ns1:findEBooks>
                </s11:Body>
            </s11:Envelope>
        </Payload>
        <Verb>POST</Verb>
    </Set>
    <IgnoreUnresolvedVariables>true</IgnoreUnresolvedVariables>
    <AssignTo createNew="false" transport="http" type="request"/>
</AssignMessage>